def z1():
    pas1 = input("Введите пароль ")
    pas2 = input("Введите пароль ещё раз ")
    if pas1 == pas2:
        print("Пароль принят")
    else:
        print("Пароль не принят")

def z2():
    n=int(input("Введите место в вагоне "))
    if n>36:
        print("Боковое место")
    elif n%2:
        print("Нижнее место")
    else:
        print("Верхнее место")

def z3():
    g=int(input("Введите год "))
    if (g % 4 == 0 and g % 100 !=0) or (g % 400 == 0):
        print(g, "високосный год")
    else:
        print(g, "не високосный год")

def z4():
    c1=input("Ввведите первый цвет")
    c2=input("Введите второй цвет")
    if (c1 == "Красный" or c1 == "Синий" or c1 == "Желтый") and (c2 == "Красный" or c2 == "Синий" or c2 == "Желтый"):
        if (c1 == "Красный" and c2 == "Синий") or (c1 == "Синий" and c2 == "Красный"):
            print("Вторичный цвет: Фиолетовый")
        if (c1 == "Красный" and c2 == "Желтый") or (c1 == "Желтый" and c2 == "Красный"):
            print("Вторичный цвет: Оранжевый")
        if (c1 == "Желтый" and c2 == "Синий") or (c1 == "Синий" and c2 == "Желтый"):
            print("Вторичный цвет: Зеленый")
    else:
        print("Ошибка, введите основные цвета")

def z5():
    n=int(input("Кол-во слов: "))
    spisok=[]
    for i in range(1,n+1):
        s=str(input())
        spisok.append(s)
    print(" ".join(spisok))
